Tekla.Structures.Model.Operations.Operation.CreateDGNv8Export(System.String,System.String,Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,System.String,System.Boolean)
Dgn export from all or selected objects.
FileName:  The file name.
Folder:  The folder.
BasePoint: Defines which base point is used in export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
ObjectColoring: Defines which object coloring filter is to be used in export.
ExportLayersAs: Defines which report field to use for layers export.
OnlyFromSelectedObjects: Defines if only selected (value true) or all (value false) objects are exported.
Returns: bool, defines the final run state.